Repository: alabs/petateca
Catalog: petateca/invitation/locale/*/LC_MESSAGES/django.po
Languages: de

source: invitation key
de: Einladungscode

source: date invited
de: Einladungsdatum

source: Invitation sent
de: Die Einladung wurde verschickt!

source: Your friend will receive an email with your invitation soon!
de: Der/die Empfänger/in wird in Kürze eine Email mit deiner Einladung erhalten.

source: You have been invited by %(username)s to join %(sitename)s!
de: Du hast eine Einladung von %(username)s zu %(sitename)s bekommen!

source: Go to
de: Klick auf

source: to join!
de: um mitzumachen!

source: All the best, The %(sitename)s Team
de: Alles Gute, Das %(sitename)s Team

source: Invitation from %(username)s to join %(sitename)s
de: Einladung von %(username)s zu %(sitename)s

source: Invite a friend
de: Leute einladen

source: Send Invitation
de: Einladung abschicken

source: You have been invited!
de: Du wurdest eingeladen!

source: proceed to registration
de: Weiter zur Registrierung
